app/controllers/pins_controller.rb

INSERT INTO "pins" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
  def create
    @pin = current_user.pins.build(pin_params)

    if @pin.save